app/controllers/pokemons_controller.rb

SELECT "pokemons".* FROM "pokemons" LIMIT ? OFFSET ?  [["LIMIT", 30], ["OFFSET", 0]]
---
  def index
    @pokemons = Pokemon.paginate(page: params[:page], per_page: params[:per_page])

INSERT INTO "pokemons" ("name", "type_1", "type_2", "total", "hp", "attack", "defense", "sp_atk", "sp_def", "speed", "generation", "legendary", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @pokemon = Pokemon.new(pokemon_params)

    if @pokemon.save

UPDATE "pokemons" SET "name" = ?, "updated_at" = ? WHERE "pokemons"."id" = ?  [["name", "Volcanion Large"], ["updated_at", "2022-08-07 23:36:47.715449"], ["id", 800]]
---
  def update
    if @pokemon.update(pokemon_params)

DELETE FROM "pokemons" WHERE "pokemons"."id" = ?  [["id", 800]]
---
  def destroy
    @pokemon.destroy

SELECT "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = ? LIMIT ?  [["id", 801], ["LIMIT", 1]]
---
    def set_pokemon
      @pokemon = Pokemon.find(params[:id])